Nexenta/illumos-nexenta/usr/src/man/man7d/aoe.7d
.\"
.\" This file and its contents are supplied under the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.illumos.org/license/CDDL.
.\"
.\"
.\" Copyright 2012 Nexenta Systems, Inc. All rights reserved.
.\"
.Dd November 17, 2012
.Dt AOE 7D
.Os
.Sh NAME
.Nm aoe
.Nd AoE (ATA Over Ethernet) core driver
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
TBD
